{
  "backend/main.mo": "Main backend actor implementing an e-commerce item management system with CRUD operations (add, get, delete items) and payment processing, using blob storage for images and a Map for in-memory item storage.",
  "feature_evidence.json": "Feature evidence report documenting that the admin panel routing accessibility feature is implemented in Navigation.tsx with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing a complete e-commerce checkout widget with storefront, admin panel, cart, checkout flow, and supporting components.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a complete design system for light and dark modes using OKLCH color space.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "TanStack Router configuration defining five routes (storefront, admin, cart, checkout, success) wrapped in a Layout component with navigation.",
  "frontend/src/components/ItemForm.tsx": "Passcode-protected (3415) admin form component for adding new products with fields for name, description, price, and image upload with preview and progress tracking.",
  "frontend/src/components/ItemList.tsx": "Admin component displaying all store items in a scrollable list with images, details, prices, and delete functionality with confirmation dialogs.",
  "frontend/src/components/Layout.tsx": "Simple layout wrapper component that renders Navigation header and children content in a flex column structure.",
  "frontend/src/components/Navigation.tsx": "Navigation header with links to home, admin panel (with Settings icon), and cart (with ShoppingCart icon and item count badge).",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying item image, name, description, price, and add-to-cart button with visual feedback animation on successful addition.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing backend actor creation with Internet Identity authentication, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCart.ts": "Zustand store for shopping cart management with persistent storage, providing functions to add, remove, update quantities, clear cart, and calculate totals.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and providing authentication status throughout the app.",
  "frontend/src/hooks/useItems.ts": "React Query hooks for fetching items, adding items, deleting items, and processing payments through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light and dark themes, defining colors, spacing, and utility classes for the e-commerce UI.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page with passcode authentication (3415) that displays ItemForm and ItemList components for managing store inventory.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with quantity controls, item removal, and checkout navigation with total calculation.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that processes simulated payments with progress indicator, processes each cart item, and navigates to success page upon completion.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment confirmation page displaying a simulated order number and success message with option to continue shopping.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page that fetches and displays products in a responsive grid using ProductCard components with loading state.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, Inter font family, custom animations (accordion, fade-in), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting an embedded checkout component with admin panel (passcode 3415), item management, shopping cart, simulated payments, and existing features including delete functionality and streamlined interface for Google Sites embedding."
}