{
  "backend/main.mo": "Main backend actor implementing an e-commerce item management system with CRUD operations (getItems, addItem, deleteItem) and payment processing, using blob storage for images and a Map for in-memory item storage.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: useDeleteItem React Query mutation hook and delete buttons in ItemList component with confirmation dialogs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the e-commerce application's components, pages, hooks, and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a comprehensive design system using OKLCH color format for light and dark modes with teal/emerald palette.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for storefront, admin, cart, checkout, and payment success pages, all wrapped in a Layout component.",
  "frontend/src/components/ItemForm.tsx": "Admin form component for adding new products with fields for name, description, price, and image upload with preview, progress tracking, and integration with useAddItem mutation hook.",
  "frontend/src/components/ItemList.tsx": "Admin component displaying all store items with images, details, and delete buttons that trigger confirmation dialogs and call the useDeleteItem mutation hook.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component providing consistent page structure with Navigation header, main content area, and footer with caffeine.ai attribution.",
  "frontend/src/components/Navigation.tsx": "Sticky navigation header with store branding, links to storefront and admin pages, and shopping cart button displaying item count badge.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying item image, name, description, price, and add-to-cart button with visual feedback animation on successful addition.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP actor instance with Internet Identity authentication, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCart.ts": "Zustand store hook for shopping cart management with persistent storage, providing functions to add, remove, update quantities, and calculate totals.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validity.",
  "frontend/src/hooks/useItems.ts": "React Query hooks for fetching items and mutations for adding, deleting items, and processing payments through the ICP backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a professional e-commerce color palette for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page with passcode authentication (3415) that displays ItemForm and ItemList components for managing store inventory.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with quantity controls, item removal, and order summary with checkout navigation.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page with simulated payment processing that shows progress animation, processes payments for cart items, and redirects to success page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a payment success confirmation page with a randomly generated order number and a button to return to the storefront, emphasizing that the transaction is simulated.",
  "frontend/src/pages/StorefrontPage.tsx": "Renders the customer-facing storefront with a hero banner and a grid of product cards fetched via the useItems hook, showing loading states and empty states as needed.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom theme extensions including OKLCH color system, Inter font family, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state including implemented features for a passcode-protected admin panel (3415), item management, customer storefront, shopping cart, and simulated payment system designed for Google Sites embedding."
}