{
  "kind": "build_request",
  "title": "Restore admin panel with passcode-protected product management interface",
  "projectName": "Checkout Widget",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Restore the admin panel interface that displays both the passcode-protected ItemForm component for adding products and the ItemList component for viewing/managing existing products",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Make sure to add the old block, like the one that says where you can add the products and the passcode. Like the admin."
        ]
      },
      "acceptanceCriteria": [
        "The admin interface displays the passcode entry field requiring '3415' before showing the add product form",
        "After entering the correct passcode, the ItemForm component becomes visible with fields for name, description, price, and image upload",
        "The ItemList component displays all existing products with delete buttons",
        "The admin panel layout matches the previous implementation structure"
      ]
    },
    {
      "id": "REQ-15",
      "text": "Ensure the admin panel remains accessible within the application's routing structure",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Make sure to add the old block, like the one that says where you can add the products and the passcode. Like the admin."
        ]
      },
      "acceptanceCriteria": [
        "The admin route exists and is navigable",
        "Users can access the admin panel to manage products",
        "The admin functionality works independently from the main checkout flow"
      ]
    }
  ],
  "constraints": [
    "Maintain the existing passcode '3415' for admin access",
    "Preserve the existing ItemForm and ItemList component functionality",
    "Keep the backend deleteItem and addItem methods unchanged"
  ],
  "nonGoals": [
    "Changing the admin passcode",
    "Modifying the product data structure",
    "Adding new admin features beyond restoring existing functionality"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}